
# Словари для сокращения дней недели и месяцев
WEEKDAY_SHORTCUTS = {
    "понедельник": "пн",
    "вторник": "вт",
    "среда": "ср",
    "четверг": "чт",
    "пятница": "пт",
    "суббота": "сб",
    "воскресенье": "вс",
}

MONTH_SHORTCUTS = {
    "01": "янв",
    "02": "фев",
    "03": "март",
    "04": "апр",
    "05": "май",
    "06": "июн",
    "07": "июл",
    "08": "авг",
    "09": "сен",
    "10": "окт",
    "11": "ноя",
    "12": "дек",
}

async def return_to_main_menu(message, user_role, keyboard):
    """
    Возвращает пользователя в главное меню в зависимости от его роли.
    :param message: Объект сообщения.
    :param user_role: Роль пользователя (manager, admin, employee).
    :param keyboard: Клавиатура для роли пользователя.
    """
    await message.answer(f"Возвращаюсь в главное меню для роли {user_role}.", reply_markup=keyboard)